app/Controllers/AppController.php

SELECT *
FROM `foto`
ORDER BY `judul_foto` ASC
SELECT *
FROM `album`
ORDER BY `album_id` ASC
---
    public function home(){
        $judul_foto = $this->request->getVar("judul_foto");
        if ($judul_foto == null) {
            $rows = $this->fotoModel
                ->orderBy("judul_foto", "asc")
                ->FindAll();
        } else {
            $rows = $this->fotoModel
                ->orderBy("judul_foto", "asc")
                ->like("judul_foto", $judul_foto)
                ->findall();
        }
        $rows1 = $this->albumModel
                ->orderBy("album_id", "asc")
                ->FindAll();

SELECT *
FROM `album`
ORDER BY `album_id` ASC
SELECT *
FROM `user`
ORDER BY `user_id` ASC
---
    public function tambah_foto(){
        $rows1 = $this->albumModel
                ->orderBy("album_id","asc")
                ->FindAll();
        $rows2 = $this->userModel
                ->orderBy("user_id","asc")
                ->FindAll();

SELECT *
FROM `foto`
LEFT JOIN `album` ON `album`.`album_id`=`foto`.`album_id`
LEFT JOIN `user` ON `user`.`user_id`=`foto`.`user_id`
ORDER BY `foto_id` ASC
---
    public function data_foto(){
        $rows = $this->fotoModel
                ->join("album","album.album_id=foto.album_id","left")
                ->join("user","user.user_id=foto.user_id","left")
                ->orderBy("foto_id","asc")
                ->FindAll();

SELECT *
FROM `foto`
LEFT JOIN `user` ON `user`.`user_id`=`foto`.`user_id`
WHERE `foto_id` = '33'
 LIMIT 1
SELECT `komentar_foto`.*, `user`.`username`
FROM `komentar_foto`
JOIN `user` ON `user`.`user_id` = `komentar_foto`.`user_id`
WHERE `foto_id` = '33'
SELECT COUNT(*) AS `numrows`
FROM `like_foto`
WHERE `foto_id` = '33'
SELECT COUNT(*) AS `numrows`
FROM `like_foto`
WHERE `user_id` = '4'
AND `foto_id` = '33'
---
    public function preview($foto_id){
        $userId = session()->user_id;
        $rows = $this->fotoModel
                ->join("user","user.user_id=foto.user_id","left")
                ->where("foto_id",$foto_id)
                ->first();

        $komentar = $this->komentarModel
                    ->join('user', 'user.user_id = komentar_foto.user_id')
                    ->select('komentar_foto.*, user.username')
                    ->where("foto_id",$foto_id)
                    ->findall();


        $like = $this->likeModel->where("foto_id", $foto_id)->countAllResults();

        $isLiked = $this->likeModel->where("user_id", $userId)->where("foto_id", $foto_id)->countAllResults() > 0;

DELETE FROM `foto`
WHERE `foto_id` = '32'
---
    public function hapus_foto($foto_id){
        $this->fotoModel
        ->where("foto_id",$foto_id)->delete();

INSERT INTO `like_foto` (`foto_id`, `user_id`) VALUES ('33', '4')
---
    public function like($id){
        $userId = session()->user_id;

        if ($userId) {
            $like = $this->likeModel->where('foto_id', $id)->
                where('user_id', $userId)->first();

            if ($like) {
                $this->likeModel->where("foto_id", $id)
                 ->where("user_id", $userId)->delete();
            } else {
                $this->likeModel->insert(['foto_id' => $id, 'user_id' => $userId]);