app/Controllers/LoginController.php

    public function proses_login(){
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel
        ->where("username",$username)
        ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Admin'
 LIMIT 1